Tekla.Structures.Drawing.MarkSet
The MarkSet class defines mark set objects that contain several mark objects merged to one mark set.

Tekla.Structures.Drawing.MarkSet.Attributes
Gets or sets the mark set attributes.

Tekla.Structures.Drawing.MarkSet.Insert
Mark sets cannot be inserted.
Returns: An exception.

Tekla.Structures.Drawing.MarkSet.Modify
Calls the system to update/modify the object.
Throws Tekla.Structures.Drawing.InvalidAttributesForOperationException: Thrown if Attributes contains values that are not supported by the object.
Returns: True on success.

Tekla.Structures.Drawing.MarkSet.Select
Calls the system to select and retrieve the object.
Returns: True on success.

Tekla.Structures.Drawing.MarkSet.Delete
Calls the system to delete the object.
Returns: True on success.

Tekla.Structures.Drawing.MarkSet.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.